#+TITLE: Debian-based production containers
#+LANGUAGE: en
#+PROPERTY: header-args:python :tangle lib/debian.py
#+PROPERTY: header-args:bash   :tangle no :dir (expand-file-name ".." default-directory) :results verbatim :cache yes

Some of my services need libraries or tools that are only well-packaged
on Debian. I want Debian slim containers with the same defaults as my
Alpine ones: correct timezone, no unnecessary packages pulled in, and
easy user setup.

#+begin_src python
import shlex

import dagger
from dagger import dag, function
#+end_src

* Disabling automatic recommends

  Debian's apt installs recommended packages by default, which bloats
  images. I disable this globally so every =apt install= stays lean.

  #+begin_src python
  @function
  def debian_no_auto_install(self, ctr: dagger.Container) -> dagger.Container:
      """Disable apt recommends and suggests."""
      return ctr.with_exec([
          "sh", "-c",
          'echo \'APT::Install-Recommends "0";\' > /etc/apt/apt.conf.d/01norecommend'
          " && "
          'echo \'APT::Install-Suggests "0";\' >> /etc/apt/apt.conf.d/01norecommend',
      ])
  #+end_src

* Setting the timezone on Debian

  Debian ships timezone data by default, so it's simpler than Alpine: just
  symlink the right zoneinfo file.

  #+begin_src python
  @function
  def debian_set_tz(self, ctr: dagger.Container) -> dagger.Container:
      """Set timezone on a Debian container (uses Lib.timezone)."""
      return (
          ctr
          .with_exec(["rm", "/etc/localtime"])
          .with_exec(["ln", "-sf", f"/usr/share/zoneinfo/{self.timezone}", "/etc/localtime"])
      )
  #+end_src

* Cleaning up apt caches

  After installing packages, I clean up to keep the image small.

  #+begin_src python
  @function
  def debian_apt_cleanup(self, ctr: dagger.Container) -> dagger.Container:
      """Clean apt caches."""
      return ctr.with_exec([
          "sh", "-c",
          "apt-get --quiet clean && rm -rf /var/lib/apt/lists/*",
      ])
  #+end_src

* A base Debian container

  This is the Debian equivalent of my Alpine target: slim image with
  timezone set, no recommends, and optional extra packages.

  #+begin_src python
  @function
  def debian(self, distro_packages: list[str] = ()) -> dagger.Container:
      """Debian slim with timezone set, no auto-install, and optional extra packages."""
      ctr = dag.container().from_(f"debian:{self.debian_tag}")
      ctr = self.debian_no_auto_install(ctr)
      ctr = self.debian_set_tz(ctr)
      if distro_packages:
          packages_str = shlex.join(distro_packages)
          ctr = ctr.with_exec([
              "sh", "-c",
              "{ apt-get --quiet update"
              f" && apt-get --quiet install --yes {packages_str}"
              " ; } > /tmp/log 2>&1 || { cat /tmp/log; exit 1; }",
          ])
          ctr = self.debian_apt_cleanup(ctr)
      return ctr
  #+end_src

  #+NAME: debian_timezone
  #+begin_src fixtureyaml
func: debian
chain:
  - with-exec: [sh, -c, "readlink -f /etc/localtime"]
  - stdout
  #+end_src

#+RESULTS: debian_timezone
:results:
#+NAME: debian_timezone-run
#+begin_src bash :exports code :eval no-export
dagger call debian with-exec --args="sh","-c","readlink -f /etc/localtime" stdout
#+end_src

#+RESULTS[01a6b12292aadb99ade1a778711d2a6df5f24bb4]: debian_timezone-run
: /usr/share/zoneinfo/Europe/Paris

#+BEGIN_SRC org :tangle (expand-file-name "tests/expected/debian_timezone" (locate-dominating-file default-directory ".git")) :noweb yes :exports none :comments no :padline no
<<debian_timezone-run()>>
#+END_SRC
:end:

  #+NAME: debian_no_recommends
  #+begin_src fixtureyaml
func: debian
chain:
  - with-exec: [cat, /etc/apt/apt.conf.d/01norecommend]
  - stdout
  #+end_src

#+RESULTS: debian_no_recommends
:results:
#+NAME: debian_no_recommends-run
#+begin_src bash :exports code :eval no-export
dagger call debian with-exec --args="cat","/etc/apt/apt.conf.d/01norecommend" stdout
#+end_src

#+RESULTS[0de417fd2a0269c3fb962c932fc14b820cda354f]: debian_no_recommends-run
: APT::Install-Recommends "0";
: APT::Install-Suggests "0";

#+BEGIN_SRC org :tangle (expand-file-name "tests/expected/debian_no_recommends" (locate-dominating-file default-directory ".git")) :noweb yes :exports none :comments no :padline no
<<debian_no_recommends-run()>>
#+END_SRC
:end:

  #+NAME: debian_distro_packages
  #+begin_src fixtureyaml
func: debian
args:
  distro-packages: [curl]
chain:
  - with-exec: [which, curl]
  - stdout
  #+end_src

#+RESULTS: debian_distro_packages
:results:
#+NAME: debian_distro_packages-run
#+begin_src bash :exports code :eval no-export
dagger call debian --distro-packages=curl with-exec --args="which","curl" stdout
#+end_src

#+RESULTS[7c5824f53575d6bcc11d74523151492a63c48b0b]: debian_distro_packages-run
: /usr/bin/curl

#+BEGIN_SRC org :tangle (expand-file-name "tests/expected/debian_distro_packages" (locate-dominating-file default-directory ".git")) :noweb yes :exports none :comments no :padline no
<<debian_distro_packages-run()>>
#+END_SRC
:end:

* Debian with a default user

  Same pattern as Alpine: a non-root user ready to go.

  #+begin_src python
  @function
  def debian_user(self, distro_packages: list[str] = ()) -> dagger.Container:
      """Debian with a default user."""
      ctr = self.debian(distro_packages=distro_packages)
      return self.use_user(ctr)
  #+end_src

  #+NAME: debian_user_check
  #+begin_src fixtureyaml
func: debian-user
chain:
  - with-exec: ["id", sam]
  - stdout
  #+end_src

#+RESULTS: debian_user_check
:results:
#+NAME: debian_user_check-run
#+begin_src bash :exports code :eval no-export
dagger call debian-user with-exec --args="id","sam" stdout
#+end_src

#+RESULTS[898165760f23cc8ed923ba7e61bd3a00a2e3503b]: debian_user_check-run
: uid=1000(sam) gid=1000(sam) groups=1000(sam),100(users)

#+BEGIN_SRC org :tangle (expand-file-name "tests/expected/debian_user_check" (locate-dominating-file default-directory ".git")) :noweb yes :exports none :comments no :padline no
<<debian_user_check-run()>>
#+END_SRC
:end:

* Python with a user and virtualenv on Debian

  For Python services that need Debian-specific libraries (e.g., for
  native extensions), I want the same venv setup as Alpine but on Debian.

  #+begin_src python
  @function
  def debian_python_user_venv(
      self,
      distro_packages: list[str] = (),
      groups: list[str] = (),
      pip_packages: list[str] = (),
      work_dir: str = "/app",
  ) -> dagger.Container:
      """Debian with python, user, and a virtualenv."""
      ctr = self.debian(distro_packages=["python3-venv"] + list(distro_packages))
      return self.python_user_venv(ctr, groups=groups, pip_packages=pip_packages, work_dir=work_dir)
  #+end_src

  #+NAME: debian_python_user_venv_check
  #+begin_src fixtureyaml
func: debian-python-user-venv
chain:
  - with-exec: [sh, -c, "test -d /app/venv && /app/venv/bin/python --version"]
  - stdout
  #+end_src

#+RESULTS: debian_python_user_venv_check
:results:
#+NAME: debian_python_user_venv_check-run
#+begin_src bash :exports code :eval no-export
dagger call debian-python-user-venv with-exec --args="sh","-c","test -d /app/venv && /app/venv/bin/python --version" stdout
#+end_src

#+RESULTS[ac345ff39b6f97909cf1e495f555e3e80ad19057]: debian_python_user_venv_check-run
: Python 3.13.5

#+BEGIN_SRC org :tangle (expand-file-name "tests/expected/debian_python_user_venv_check" (locate-dominating-file default-directory ".git")) :noweb yes :exports none :comments no :padline no
<<debian_python_user_venv_check-run()>>
#+END_SRC
:end:

* Extracting the localtime file

  Distroless containers can't install packages. I extract the timezone
  file from the existing [[*A base Debian container][debian()]] container so I can copy it into
  distroless images.

  [[https://docs.dagger.io/api/reference#definition-Container][.file(path)]] extracts a single file from the container as a [[https://docs.dagger.io/api/reference#definition-File][File]]
  artifact. Since =debian()= already sets the timezone, we just pull
  =/etc/localtime= from it — no need to create a separate container.

  #+begin_src python
  @function
  def debian_localtime(self) -> dagger.File:
      """Extract the localtime file from a Debian container."""
      return self.debian().file("/etc/localtime")
  #+end_src

  #+NAME: debian_localtime_export
  #+begin_src fixtureyaml
func: debian-localtime
chain:
  - export: $TMP/out/localtime
post: test -s "$TMP/out/localtime" && echo "non-empty"
  #+end_src

#+RESULTS: debian_localtime_export
:results:
#+NAME: debian_localtime_export-run
#+begin_src bash :exports code :eval no-export
dagger call debian-localtime export --path="$TMP/out/localtime" > /dev/null
test -s "$TMP/out/localtime" && echo "non-empty"
#+end_src

#+RESULTS[4292ba9c4765294ea5425370cf7b11dad2328abd]: debian_localtime_export-run
: non-empty

#+BEGIN_SRC org :tangle (expand-file-name "tests/expected/debian_localtime_export" (locate-dominating-file default-directory ".git")) :noweb yes :exports none :comments no :padline no
<<debian_localtime_export-run()>>
#+END_SRC
:end:
